---
type: IDuplicateTypeNamesHandler
namespace: Autodesk.Revit.DB
version: 2024
members: 1
tags: [revit-api, class]
---

# IDuplicateTypeNamesHandler

`Autodesk.Revit.DB.IDuplicateTypeNamesHandler` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | OnDuplicateTypeNamesFound | 2014 | `DuplicateTypeAction OnDuplicateTypeNamesFound ( DuplicateTypeNamesHandlerArgs args )` |